#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/whip-up/csharp-clean-architecture-github-action/runs/run-vzFLWLtCxCCmYfTQ

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_iam_role.task: Refreshing state... [id=terraform-20230427135024309700000002]
data.aws_vpc.this: Refreshing...
aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:cluster/clean-slice-cluster]
aws_acm_certificate.temporary: Refreshing state... [id=arn:aws:acm:ap-southeast-2:467945566648:certificate/c323b669-3e5d-4940-bfda-e5fbebb6ee08]
data.aws_region.current: Refreshing...
data.aws_caller_identity.current: Refreshing...
aws_ecr_repository.dot-net-architecture: Refreshing state... [id=clean-slice]
aws_acm_certificate.temporary: Refreshing state... [id=arn:aws:acm:ap-southeast-2:467945566648:certificate/4a94a317-0d0f-4aed-92f8-323572c35daf]
data.aws_region.current: Refresh complete after 0s [id=ap-southeast-2]
data.aws_caller_identity.current: Refresh complete after 0s [id=467945566648]
aws_iam_role_policy.task: Refreshing state... [id=terraform-20230427135024309700000002:terraform-20230427135024933600000004]
aws_iam_role_policy_attachment.task[0]: Refreshing state... [id=terraform-20230427135024309700000002-20230427135025049600000005]
data.aws_vpc.this: Refresh complete after 2s [id=vpc-d23709b5]
data.aws_subnets.this: Refreshing...
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11]
aws_security_group.this: Refreshing state... [id=sg-0e1ef5e8e637d4a4f]
data.aws_subnets.this: Refresh complete after 0s [id=ap-southeast-2]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:loadbalancer/app/clean-slice-alb/0d8a0f9701063a6c]
aws_acm_certificate.temporary: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-southeast-2:467945566648:cluster/clean-slice-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "clean-slice"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "clean-slice"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0e1ef5e8e637d4a4f",
            ]
          + subnets          = [
              + "subnet-2770e17f",
              + "subnet-cda3b384",
              + "subnet-f7df3991",
            ]
        }
    }

  # aws_ecs_task_definition.initiator will be created
  + resource "aws_ecs_task_definition" "initiator" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command      = [
                      + "/bin/sh -c \"echo '<html> <head> <title>Attention</title> <style>body {margin-top: 40px; background-color: #333;} </style> </head><body> <div style=color:white;text-align:center> <h1>clean-slice</h1>  <p>Your application is now running on a container in Amazon ECS. Allow pipeline to deploy application.</p> </div></body></html>' >  /usr/local/apache2/htdocs/index.html && httpd-foreground\"",
                    ]
                  + entryPoint   = [
                      + "sh",
                      + "-c",
                    ]
                  + image        = "httpd:2.4"
                  + name         = "clean-slice"
                  + portMappings = [
                      + {
                          + containerPort = 80
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::467945566648:role/terraform-20230427135024309700000002"
      + family                   = "clean-slice-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }
      + task_role_arn            = "arn:aws:iam::467945566648:role/terraform-20230427135024309700000002"
    }

  # aws_lb_listener.this will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:loadbalancer/app/clean-slice-alb/0d8a0f9701063a6c"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Sorry, we could not find the resource you were looking for. Please check your request and try again."
              + status_code  = "404"
            }
        }
    }

  # aws_lb_listener_rule.this will be created
  + resource "aws_lb_listener_rule" "this" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11"
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/api/*",
                ]
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_ecs_service      = (known after apply)

```

</details>

*Pushed by: @jonyeezs*